import matplotlib.pyplot as plt

# 直接写死 RMSE / ACC 列表
rmse_3y = [
    73.138, 82.347, 92.009, 107.742, 124.139, 153.947, 183.604, 218.291,
    256.401, 296.819, 330.191, 353.996, 366.081, 381.454, 391.692, 396.933,
    399.054, 410.015, 423.868, 439.887, 450.144, 460.501, 473.443, 492.178,
    516.154, 544.570, 570.492, 597.244, 619.331, 644.403, 667.388, 693.024,
    718.107, 744.455, 765.647, 788.130, 807.637, 833.714, 850.115, 862.889
]
acc_3y = [
    0.997, 0.996, 0.994, 0.992, 0.990, 0.984, 0.977, 0.967,
    0.955, 0.937, 0.922, 0.909, 0.903, 0.889, 0.883, 0.881,
    0.884, 0.873, 0.869, 0.866, 0.865, 0.854, 0.848, 0.842,
    0.829, 0.800, 0.774, 0.751, 0.726, 0.684, 0.652, 0.624,
    0.600, 0.568, 0.542, 0.513, 0.494, 0.479, 0.460, 0.453
]

rmse_1y = [
    76.346, 84.238, 96.302, 109.590, 126.130, 151.447, 179.870, 212.212,
    247.384, 284.285, 314.344, 335.266, 347.047, 363.906, 376.475, 385.797,
    392.103, 403.961, 418.774, 437.821, 452.854, 467.777, 483.256, 501.527,
    521.751, 545.572, 568.655, 594.323, 615.517, 639.367, 656.813, 671.420,
    686.385, 704.540, 716.581, 725.134, 732.636, 744.147, 749.919, 755.346
]
acc_1y = [
    0.996, 0.995, 0.994, 0.992, 0.989, 0.985, 0.979, 0.970,
    0.959, 0.943, 0.930, 0.920, 0.914, 0.901, 0.895, 0.891,
    0.891, 0.881, 0.876, 0.871, 0.867, 0.852, 0.844, 0.837,
    0.824, 0.796, 0.771, 0.748, 0.725, 0.684, 0.660, 0.646,
    0.632, 0.605, 0.586, 0.570, 0.560, 0.553, 0.541, 0.540
]

# 画图
steps = list(range(1, len(rmse_3y)+1))
plt.figure(figsize=(12, 5))

def set_y_margin(ax, data_a, data_b, ratio=0.08):
    vmin = min(min(data_a), min(data_b))
    vmax = max(max(data_a), max(data_b))
    pad = (vmax - vmin) * ratio
    ax.set_ylim(vmin - pad, vmax + pad)

plt.subplot(1, 2, 1)
plt.plot(steps, rmse_3y, label='3年 RMSE')
plt.plot(steps, rmse_1y, label='1年 RMSE')
plt.xlabel('Step')
plt.ylabel('RMSE')
plt.title('GFS2ERA5 RMSE对比')
plt.legend()
plt.grid(True)
set_y_margin(plt.gca(), rmse_3y, rmse_1y, ratio=0.12)

plt.savefig("z500_rmse.png")
plt.close()

plt.subplot(1, 2, 2)
plt.plot(steps, acc_3y, label='3年 ACC')
plt.plot(steps, acc_1y, label='1年 ACC')
plt.xlabel('Step')
plt.ylabel('ACC')
plt.title('GFS2ERA5 ACC对比')
plt.legend()
plt.grid(True)
set_y_margin(plt.gca(), acc_3y, acc_1y, ratio=0.12)

plt.tight_layout()
plt.savefig("z500_acc.png")
plt.close()
